{
  "title": "Trapped",
  "scenes": [
    {
      "name": "The Beginning",
      "commands": [
        {
          "name": "ShowText",
          "args": ["The days drag on as usual; the sounds of keyboards click-clacking away to provide value to our corporate overlords."]
        },
        {
          "name": "ShowText",
          "args": ["I'm no different; I'm still working hard to make a name for myself at the company. My team and I did amazing job last year, and as a result we've been working on project after project. My name is established...but could always could be better."]
        },
        { "name": "ShowText",
          "args": ["Tap, tap, tap, the sound of reality bringing me back to Earth."]
        },
        {
          "name": "ShowTextP",
          "args": ["???", "Things are starting to get crazy; we have cases in the US now! You think we'll get to stay at home? I'll finally have time to catch up on all my Netflix series."]
        },
        {
          "name": "ShowTextP",
          "args": ["Me", "It shouldn't be a big deal; I'm sure that it won't get out of hand. Even if it does, there's no way it'll touch us in Connecticut. Everything is happening on the West Coast. Again, it's not that serious. Anyway, let's finish work for today."]
        },
        {
          "name": "ShowText",
          "args": ["\"2020 is my year...\" I mumbled to myself while pounding the keys as if I had cinderblocks for fingers. This year I made a vow to myself to grow more as a person and finally change my life. This year is going to be different."]
        },
        {
          "name": "ShowText",
          "args": ["Last year I made a name for myself at the company, bringing them a lot of business, but for me this wasn't something I always wanted to do. I felt there was more to my life than a 9-5 job and developing software."]
        },
        {
          "name":"ShowText",
          "args":["I knew I wanted to live outside the box, but there was something...something hold me back from that."]
        }
      ]
    }
  ]
}